{
    "_index": ".internal.alerts-security.alerts-default-000001",
    "_id": "bbaf6082f48becd0e751761e9ac31a1939cf945a13b42497ae3d5d2fbed511ff",
    "_score": null,
    "_source": {
      "kibana.version": "8.5.2",
      "kibana.alert.rule.category": "Custom Query Rule",
      "kibana.alert.rule.consumer": "siem",
      "kibana.alert.rule.execution.uuid": "d3fc0f4e-8445-4d43-902d-957c26349885",
      "kibana.alert.rule.name": "Warnings",
      "kibana.alert.rule.producer": "siem",
      "kibana.alert.rule.rule_type_id": "siem.queryRule",
      "kibana.alert.rule.uuid": "ebff6080-75a1-11ed-8800-c74f8acb6826",
      "kibana.space_ids": [
        "default"
      ],
      "kibana.alert.rule.tags": [],
      "@timestamp": "2022-12-06T20:14:56.338Z",
      "process": {
        "pid": 20
      },
      "agent": {
        "name": "988d80d53d76",
        "id": "4c612df8-401d-4a32-9bad-1c7d99ac9210",
        "ephemeral_id": "bd3982dd-12e6-430d-8466-427ad0771de1",
        "type": "filebeat",
        "version": "8.5.2"
      },
      "log": {
        "file": {
          "path": "/app/logs/kibana-json.log"
        },
        "offset": 49578,
        "level": "INFO",
        "logger": "plugins.securitySolution.telemetry_events"
      },
      "message": """Events sent!. Response: 200 {"status":"ok"}""",
      "fileset": {
        "name": "log"
      },
      "error": {
        "message": "field [json] doesn't exist"
      },
      "cloud": {
        "availability_zone": "us-central1-a"
      },
      "input": {
        "type": "log"
      },
      "trace": {
        "id": "c644452d7b7eae346a2406fe3819e395"
      },
      "ecs": {
        "version": "8.4.0"
      },
      "service": {
        "node": {
          "roles": [
            "background_tasks",
            "ui"
          ],
          "name": "instance-0000000001"
        },
        "name": "kobelb-dev2",
        "id": "40158af9de1b4c0db8580ffb61bdd282",
        "type": "kibana",
        "version": "8.5.2"
      },
      "host": {
        "name": "988d80d53d76"
      },
      "span": {
        "id": "4a5a90ce0439ed3b"
      },
      "event.ingested": "2022-12-06T20:14:12.112926783Z",
      "event.created": "2022-12-06T20:14:11.109Z",
      "event.module": "kibana",
      "event.dataset": "kibana.log",
      "event.kind": "signal",
      "kibana.alert.original_time": "2022-12-06T20:14:11.109Z",
      "kibana.alert.ancestors": [
        {
          "id": "YjwT6YQBBe4HO9bzEpiR",
          "type": "event",
          "index": ".ds-elastic-cloud-logs-8-2022.12.06-000001",
          "depth": 0
        }
      ],
      "kibana.alert.status": "active",
      "kibana.alert.workflow_status": "open",
      "kibana.alert.depth": 1,
      "kibana.alert.reason": "event on 988d80d53d76 created low alert Warnings.",
      "kibana.alert.severity": "low",
      "kibana.alert.risk_score": 21,
      "kibana.alert.rule.parameters": {
        "description": "Warnings",
        "risk_score": 21,
        "severity": "low",
        "license": "",
        "meta": {
          "from": "5m",
          "kibana_siem_app_url": "https://kobelb-dev2.kb.us-central1.gcp.cloud.es.io:9243/app/security"
        },
        "author": [],
        "false_positives": [],
        "from": "now-360s",
        "rule_id": "1945cc00-356d-4b50-b50f-f3488af282e2",
        "max_signals": 100,
        "risk_score_mapping": [],
        "severity_mapping": [],
        "threat": [],
        "to": "now",
        "references": [],
        "version": 4,
        "exceptions_list": [],
        "immutable": false,
        "related_integrations": [],
        "required_fields": [],
        "setup": "",
        "type": "query",
        "language": "kuery",
        "index": [
          "elastic-cloud-logs-8"
        ],
        "query": "error.message: *",
        "filters": []
      },
      "kibana.alert.rule.actions": [],
      "kibana.alert.rule.author": [],
      "kibana.alert.rule.created_at": "2022-12-06T20:09:43.349Z",
      "kibana.alert.rule.created_by": "2023294507",
      "kibana.alert.rule.description": "Warnings",
      "kibana.alert.rule.enabled": true,
      "kibana.alert.rule.exceptions_list": [],
      "kibana.alert.rule.false_positives": [],
      "kibana.alert.rule.from": "now-360s",
      "kibana.alert.rule.immutable": false,
      "kibana.alert.rule.interval": "1m",
      "kibana.alert.rule.indices": [
        "elastic-cloud-logs-8"
      ],
      "kibana.alert.rule.license": "",
      "kibana.alert.rule.max_signals": 100,
      "kibana.alert.rule.references": [],
      "kibana.alert.rule.risk_score_mapping": [],
      "kibana.alert.rule.rule_id": "1945cc00-356d-4b50-b50f-f3488af282e2",
      "kibana.alert.rule.severity_mapping": [],
      "kibana.alert.rule.threat": [],
      "kibana.alert.rule.to": "now",
      "kibana.alert.rule.type": "query",
      "kibana.alert.rule.updated_at": "2022-12-06T20:14:26.154Z",
      "kibana.alert.rule.updated_by": "2023294507",
      "kibana.alert.rule.version": 4,
      "kibana.alert.rule.meta.from": "5m",
      "kibana.alert.rule.meta.kibana_siem_app_url": "https://kobelb-dev2.kb.us-central1.gcp.cloud.es.io:9243/app/security",
      "kibana.alert.rule.risk_score": 21,
      "kibana.alert.rule.severity": "low",
      "kibana.alert.original_event.ingested": "2022-12-06T20:14:12.112926783Z",
      "kibana.alert.original_event.created": "2022-12-06T20:14:11.109Z",
      "kibana.alert.original_event.module": "kibana",
      "kibana.alert.original_event.dataset": "kibana.log",
      "kibana.alert.uuid": "bbaf6082f48becd0e751761e9ac31a1939cf945a13b42497ae3d5d2fbed511ff"
    },
    "fields": {
      "kibana.alert.severity": [
        "low"
      ],
      "kibana.alert.rule.updated_by": [
        "2023294507"
      ],
      "signal.ancestors.depth": [
        0
      ],
      "signal.original_event.created": [
        "2022-12-06T20:14:11.109Z"
      ],
      "service.type": [
        "kibana"
      ],
      "kibana.alert.ancestors.depth": [
        0
      ],
      "signal.rule.enabled": [
        "true"
      ],
      "signal.rule.max_signals": [
        100
      ],
      "kibana.alert.risk_score": [
        21
      ],
      "signal.rule.updated_at": [
        "2022-12-06T20:14:26.154Z"
      ],
      "agent.name": [
        "988d80d53d76"
      ],
      "kibana.alert.original_event.module": [
        "kibana"
      ],
      "kibana.alert.rule.interval": [
        "1m"
      ],
      "span.id": [
        "4a5a90ce0439ed3b"
      ],
      "kibana.alert.rule.type": [
        "query"
      ],
      "kibana.alert.rule.immutable": [
        "false"
      ],
      "agent.id": [
        "4c612df8-401d-4a32-9bad-1c7d99ac9210"
      ],
      "signal.original_event.module": [
        "kibana"
      ],
      "signal.rule.from": [
        "now-360s"
      ],
      "kibana.alert.rule.enabled": [
        "true"
      ],
      "kibana.alert.rule.version": [
        "4"
      ],
      "kibana.alert.ancestors.type": [
        "event"
      ],
      "service.node.name": [
        "instance-0000000001"
      ],
      "signal.ancestors.index": [
        ".ds-elastic-cloud-logs-8-2022.12.06-000001"
      ],
      "log.logger": [
        "plugins.securitySolution.telemetry_events"
      ],
      "agent.type": [
        "filebeat"
      ],
      "kibana.alert.rule.max_signals": [
        100
      ],
      "signal.original_event.dataset": [
        "kibana.log"
      ],
      "kibana.alert.rule.consumer": [
        "siem"
      ],
      "kibana.alert.rule.category": [
        "Custom Query Rule"
      ],
      "event.ingested": [
        "2022-12-06T20:14:12.112Z"
      ],
      "@timestamp": [
        "2022-12-06T20:14:56.338Z"
      ],
      "signal.rule.updated_by": [
        "2023294507"
      ],
      "service.version": [
        "8.5.2"
      ],
      "error.message": [
        "field [json] doesn't exist"
      ],
      "log.file.path": [
        "/app/logs/kibana-json.log"
      ],
      "agent.ephemeral_id": [
        "bd3982dd-12e6-430d-8466-427ad0771de1"
      ],
      "kibana.alert.rule.execution.uuid": [
        "d3fc0f4e-8445-4d43-902d-957c26349885"
      ],
      "kibana.alert.uuid": [
        "bbaf6082f48becd0e751761e9ac31a1939cf945a13b42497ae3d5d2fbed511ff"
      ],
      "kibana.version": [
        "8.5.2"
      ],
      "signal.rule.license": [
        ""
      ],
      "signal.ancestors.type": [
        "event"
      ],
      "kibana.alert.rule.rule_id": [
        "1945cc00-356d-4b50-b50f-f3488af282e2"
      ],
      "signal.rule.type": [
        "query"
      ],
      "kibana.alert.ancestors.id": [
        "YjwT6YQBBe4HO9bzEpiR"
      ],
      "kibana.alert.rule.description": [
        "Warnings"
      ],
      "process.pid": [
        20
      ],
      "kibana.alert.rule.producer": [
        "siem"
      ],
      "signal.rule.interval": [
        "1m"
      ],
      "signal.rule.created_by": [
        "2023294507"
      ],
      "cloud.availability_zone": [
        "us-central1-a"
      ],
      "kibana.alert.rule.to": [
        "now"
      ],
      "kibana.alert.rule.created_by": [
        "2023294507"
      ],
      "kibana.alert.original_event.ingested": [
        "2022-12-06T20:14:12.112Z"
      ],
      "signal.rule.id": [
        "ebff6080-75a1-11ed-8800-c74f8acb6826"
      ],
      "signal.rule.risk_score": [
        21
      ],
      "signal.reason": [
        "event on 988d80d53d76 created low alert Warnings."
      ],
      "log.level": [
        "INFO"
      ],
      "kibana.alert.rule.name": [
        "Warnings"
      ],
      "host.name": [
        "988d80d53d76"
      ],
      "signal.status": [
        "open"
      ],
      "event.kind": [
        "signal"
      ],
      "signal.rule.created_at": [
        "2022-12-06T20:09:43.349Z"
      ],
      "kibana.alert.workflow_status": [
        "open"
      ],
      "kibana.alert.original_event.created": [
        "2022-12-06T20:14:11.109Z"
      ],
      "kibana.alert.rule.uuid": [
        "ebff6080-75a1-11ed-8800-c74f8acb6826"
      ],
      "kibana.alert.reason": [
        "event on 988d80d53d76 created low alert Warnings."
      ],
      "signal.original_time": [
        "2022-12-06T20:14:11.109Z"
      ],
      "signal.ancestors.id": [
        "YjwT6YQBBe4HO9bzEpiR"
      ],
      "ecs.version": [
        "8.4.0"
      ],
      "signal.rule.severity": [
        "low"
      ],
      "kibana.alert.ancestors.index": [
        ".ds-elastic-cloud-logs-8-2022.12.06-000001"
      ],
      "event.created": [
        "2022-12-06T20:14:11.109Z"
      ],
      "kibana.alert.depth": [
        1
      ],
      "agent.version": [
        "8.5.2"
      ],
      "kibana.alert.rule.from": [
        "now-360s"
      ],
      "kibana.alert.rule.parameters": [
        {
          "severity_mapping": [],
          "references": [],
          "description": "Warnings",
          "language": "kuery",
          "type": "query",
          "exceptions_list": [],
          "from": "now-360s",
          "severity": "low",
          "max_signals": 100,
          "risk_score": 21,
          "risk_score_mapping": [],
          "author": [],
          "query": "error.message: *",
          "index": [
            "elastic-cloud-logs-8"
          ],
          "filters": [],
          "version": 4,
          "rule_id": "1945cc00-356d-4b50-b50f-f3488af282e2",
          "license": "",
          "required_fields": [],
          "immutable": false,
          "related_integrations": [],
          "meta": {
            "from": "5m",
            "kibana_siem_app_url": "https://kobelb-dev2.kb.us-central1.gcp.cloud.es.io:9243/app/security"
          },
          "setup": "",
          "false_positives": [],
          "threat": [],
          "to": "now"
        }
      ],
      "signal.rule.version": [
        "4"
      ],
      "service.id": [
        "40158af9de1b4c0db8580ffb61bdd282"
      ],
      "kibana.alert.status": [
        "active"
      ],
      "signal.depth": [
        1
      ],
      "kibana.alert.original_event.dataset": [
        "kibana.log"
      ],
      "signal.rule.immutable": [
        "false"
      ],
      "kibana.alert.rule.rule_type_id": [
        "siem.queryRule"
      ],
      "trace.id": [
        "c644452d7b7eae346a2406fe3819e395"
      ],
      "signal.rule.name": [
        "Warnings"
      ],
      "signal.rule.rule_id": [
        "1945cc00-356d-4b50-b50f-f3488af282e2"
      ],
      "event.module": [
        "kibana"
      ],
      "kibana.alert.rule.license": [
        ""
      ],
      "service.name": [
        "kobelb-dev2"
      ],
      "kibana.alert.rule.updated_at": [
        "2022-12-06T20:14:26.154Z"
      ],
      "signal.rule.description": [
        "Warnings"
      ],
      "message": [
        """Events sent!. Response: 200 {"status":"ok"}"""
      ],
      "signal.rule.to": [
        "now"
      ],
      "kibana.alert.rule.created_at": [
        "2022-12-06T20:09:43.349Z"
      ],
      "kibana.space_ids": [
        "default"
      ],
      "event.dataset": [
        "kibana.log"
      ],
      "kibana.alert.original_time": [
        "2022-12-06T20:14:11.109Z"
      ]
    },
    "sort": [
      1670357696338
    ]
  }